app/controllers/photos_controller.rb

  def create
    @photo = Photo.new params[:photo]
    if @photo.save
---
INSERT INTO `photos` (`finish`, `count`, `password`, `album_url`, `email`, `created_at`) VALUES(0, 0, '13920034115', 'http://photo.xiaonei.com/getalbum.do?id=247354499&owner=227601614', 'liuwenju26@gmail.com', '2009-01-29 08:50:19')

  def show
     @photo = Photo.find params[:id]
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 1)

  def update
    @photo = Photo.find params[:id]
---
SELECT * FROM `photos` WHERE (`photos`.`id` = 1)